[
  {
    "imgKey": "kend",
    "isBlog": false,
    "title": "KEND AI",
    "description": "KEND AI is a revolutional AI-based 3D CAD program that allows users to imagine architectural structures and create them in a virtual environment. The program uses AI to generate 3D models from 2D sketches, enabling users to design and visualize their ideas in real-time on web, I have developed the backend and frontend of the project including sketch mechanisms and project structures.",
    "ghLink": "https://kend.ai/"
  },
  {
    "imgKey": "editor",
    "isBlog": false,
    "title": "CodeStandardsTool",
    "description": "A tool that helps developers write better code by enforcing coding standards and checking projects for compliance. In the future, users will be able to declare their own coding standards and enforce them during commits.",
    "ghLink": "https://github.com/hasan-kayan/CodeStandartsTool"
  },
  {
    "imgKey": "wise",
    "isBlog": false,
    "title": "Compute Wise",
    "description": "ComputeWise is a comprehensive Python library designed to enhance network and system security monitoring. It provides tools for monitoring computer performance, analyzing network activity, and checking system specifications, all aimed at improving security and safeguarding environments.",
    "ghLink": "https://github.com/hasan-kayan/ComputeWise"
  },
  {
    "imgKey": "three",
    "isBlog": false,
    "title": "MeshSubtractor3D",
    "description": "This project extends the functionality of Three.js geometries by adding Constructive Solid Geometry (CSG) capabilities using the three-csg-ts library. It provides an easy-to-use interface for performing complex geometry operations such as union, subtraction, and intersection.",
    "ghLink": "https://github.com/hasan-kayan/MeshSubtractor3D"
  },
  {
    "imgKey": "uipath",
    "isBlog": false,
    "title": "Custom Activities For UiPath",
    "description": "A set of custom activities developed for UiPath automation workflows. Each activity set includes source code, NuGet packages, and development notes. Due to varying project structures, each activity has its own NuGet package. These activities are focused on Excel automation and are part of a larger collection.",
    "ghLink": "https://github.com/hasan-kayan/Custom_Activities_For_UiPath"
  },
  {
    "imgKey": "udemy",
    "isBlog": false,
    "title": "Udemy Coupon Scrapper",
    "description": "A Python script that scrapes Udemy coupons from three different websites: real.discount, discudemy.com, and couponscorpion.com. The script uses Selenium and BeautifulSoup to navigate webpages, extract coupon data, and write it to a CSV file for easy access.",
    "ghLink": "https://github.com/hasan-kayan/Udemy_Coupon_Scrapper"
  }
 
]
